{
    "website": "https://memeversx.com",
    "description": "Welcome to 2Tiers: The Meme Coin That's Also a Movement!\n\n🚀 Launching on Multiverse X - Because why settle for one universe when you can have multiple?\n\nStarting Supply: 2 Trillion - That's right, we're not messing around. We've got enough coins to make even the most stoic of crypto traders crack a smile.\n\nThe Peaceful Rebellion: In a world where even your silence can get you into trouble, 2Tiers stands as a beacon of... well, not exactly hope, but definitely a form of protest against the Western world's apparent quest for self-destruction. \n\nOur Simple Roadmap:\n- Phase 1: An X account will be created. Not just any account, but one dedicated to the noble cause of... well, mostly just driving attention to our coin, but also, you know, the whole freedom thing.\n  \n- Phase 2: If we manage to mint this coin into existence, we'll open a Telegram group. Because what's a meme coin without a place for its community to argue about the price?\n\n- Phase 3: Hit a cool $1 million USD in market cap? We'll start a non-profit. Not just any non-profit, but one that supports victims of government overreach. Because if there's one thing we love more than memes, it's irony.\n\nJoin Us, But Cautiously: This isn't your typical \"to the moon\" scenario. We're not promising riches, just a good laugh and maybe, just maybe, a tiny bit of change in the world. Or at least, a change in your crypto portfolio. \n\nDisclaimer: Do Your Own Research (DYOR). This isn't financial advice; it's more like... cosmic advice. We're here for the laughs, the freedom, and the occasional moonshot. \n\nRemember, in the grand tapestry of the universe, meme coins are like the colorful threads that make no sense but somehow hold everything together. Join 2Tiers, where your investment might not just make you chuckle, but could also, in a very roundabout way, contribute to a cause. Or not. But hey, it's a meme coin, so who really knows?",
    "status": "active",
    "social": {
        "telegram": "https://t.me/+Wl-KMIR9q240ZDA0"
    }
}
