{
    "website": "https://linktr.ee/snookerxfusion",
    "description": "SFX Token: Empowering the Evolution of Snooker\nThe SFX Token (identifier: SFX-bd7d74) is the native utility, governance, and real-yield staking token of Snooker X Fusion™, a groundbreaking evolution of snooker that fuses traditional strategy with cutting-edge sensor technology, Web3 economics, and esports excitement. Built on the high-throughput MultiversX blockchain, SFX serves as the \"Play-to-Build\" fuel powering a global ecosystem designed to attract 500 million fans and players by 2035, starting from its flagship launch in Shanghai.\nKey Tokenomics\n\nTotal & Maximum Supply: 1,000,000,000 SFX (fixed forever—no future minting or emissions beyond initial vesting).\nInitial Circulating Supply at TGE: Approximately 300,000,000 SFX.\nAllocation Breakdown:\nPublic & Private Sale: 30% (vested for fair distribution).\nEcosystem & Staking Bootstrap: 30% (unlocked gradually to reward early participants).\nTeam & Core Contributors: 20% (long-term vesting with cliffs).\nStrategic Partners & Ambassadors: 10% (performance-aligned unlocks).\nDAO Treasury & Strategic Reserve: 10% (community-governed for liquidity and burns).\n\nDeflationary Mechanisms: Aggressive burns via transaction taxes (1%), NFT mint fees (10%), and unclaimed rewards ensure 3–5% annual supply reduction at scale, driving scarcity as adoption grows.\nReal-Yield Staking: Holders earn 10–15% APY in stablecoins (USDC/USDT) from 30% of ecosystem revenues, including ads, sponsorships, NFT royalties, and entry fees—paid proportionally without USD pegging for true fairness.\n\nUtilities & Real-World Integration\nSFX unlocks a hybrid physical-digital sports revolution:\n\nPlay-to-Earn (P2E): Stake SFX to enter tournaments, predict outcomes, or earn rewards from high breaks (e.g., $100,000 bounty for a 212 Immortal break, verified on-chain via Smart Balls™).\nGovernance: Vote in the DAO on rules, events, and Surge Mode™ activations, empowering the community to shape the sport.\nReal-World Assets (RWAs): Ties to tokenized infrastructure like 22,000 Crowned Throne™ tables and Fusion Strike™ cues, generating sustainable yields from global events.\nZero-Friction Access: In China (60 million players), rewards are paid instantly in RMB for seamless adoption; globally, SFX enables free-tier entry for underserved regions via the Global Inclusion Engine™.\nMetaverse & AR/VR: Access immersive experiences, virtual arenas, and NFT evolutions in the MultiversX Web3 Hub.\n\nBacked by a $3 million strategic raise exclusively for infrastructure (MultiversX Web3 Hub, Shanghai Fusion Hub, and $1M Ignition Cup prize pool), SFX rejects speculative models in favor of real revenue flywheels. With audited smart contracts, Swiss Franc-pegged purchasing power protection, and a roadmap to a $50 million World Championship by 2030, SFX aligns players, viewers, and holders in building snooker's decentralized future.\nFor on-chain verification: MultiversX Explorer.\nCue the Future, Fuse the Legacy—Join the Revolution with SFX.",
    "status": "active"
}