{
    "website": "https://cryptoxfc.com/",
    "description": "CryptoX F.C. is the world's first football club fully integrated with blockchain technology, offering an unparalleled opportunity for fans and investors to actively shape the club's future. Built on the powerful MultiversX blockchain, CryptoX F.C. merges football tradition with cutting-edge innovation, creating a decentralized ecosystem driven by the CRX utility token.\n\n🚀 Why CryptoX F.C.?\n\nBe Part of the Game: Influence key club decisions through DAO governance powered by CRX.\nExclusive Rewards: Earn CRX through airdrops, fan engagement, and interactive gamification.\nUnique NFTs: Own a piece of history with our Investors NFTs, offering dividends and exclusive rights, or enhance your fan experience with Supporters NFTs featuring AR/VR match content and VIP access.\n📈 Join the Revolution:\nWith the guidance of Ovidiu Pop, a renowned digital influencer with over 2 million followers, CryptoX F.C. is set to become a global phenomenon, attracting both traditional football fans and blockchain enthusiasts.\n\n💡 Innovation, Passion, Victory – United Through Blockchain and Football.\nBe part of this groundbreaking journey and invest in the future of football through our CRX token.\nCryptoX F.C. este primul club de fotbal din lume complet integrat cu tehnologia blockchain, oferind o oportunitate unică pentru fani și investitori de a contribui direct la viitorul clubului. Bazat pe puternicul blockchain MultiversX, CryptoX F.C. combină tradiția fotbalului cu inovația de ultimă generație, creând un ecosistem descentralizat susținut de tokenul utilitar CRX.\n\n🚀 De ce CryptoX F.C.?\n\nFii parte din joc: Influențează deciziile cheie ale clubului prin guvernanța DAO alimentată de CRX.\nRecompense exclusive: Câștigă CRX prin airdrops, implicarea fanilor și gamificare interactivă.\nNFT-uri unice: Deține o parte din istorie cu Investors NFTs, oferind dividende și drepturi exclusive, sau îmbunătățește experiența de fan cu Supporters NFTs, ce includ conținut AR/VR și acces VIP.\n📈 Alătură-te Revoluției:\nCu sprijinul lui Ovidiu Pop, un influent digital cu peste 2 milioane de urmăritori, CryptoX F.C. este pregătit să devină un fenomen global, atrăgând atât fanii tradiționali ai fotbalului, cât și entuziaștii blockchain.\n\n💡 Inovație, Pasiune, Victorie – Uniți prin Blockchain și Fotbal.\nFii parte din această călătorie revoluționară și investește în viitorul fotbalului prin tokenul CRX.",
    "status": "active",
    "social": {
        "twitter": "https://x.com/cryptoxfc"
    }
}