{
    "social": {
        "twitter": "https://x.com/cryptoxfc"
    },
    "website": "https://cryptoxfc.com/",
    "description": "The Whitepaper(in Romanian for now and in English very soon) can be sent to You via email, please. It is over 40 pages long, and will be uploaded online once it is completed(in a few weeks, most probably).\n\nCryptoX F.C. is a revolutionary project that merges the passion of football with the transformative power of blockchain technology. Hosted on the MultiversX blockchain, CryptoX F.C. empowers fans and investors to actively shape the club’s future through a decentralized ecosystem powered by the CRX utility token.\n\nMission and Vision:\nCryptoX F.C. aims to redefine the football experience by integrating blockchain innovation, transparency, and global community participation. The project aspires to build a world-class football club that thrives on collective decision-making and shared success, creating a direct connection between the club and its supporters.\n\nCore Components:\n\nCRX Token:\n\nA utility token native to MultiversX, designed to fuel the CryptoX F.C. ecosystem.\nUse cases include:\nRewards for fan engagement and contributions.\nParticipation in exclusive NFT drops from the Investors and Supporters collections.\nVoting on strategic decisions through DAO governance.\nAccess to gamification, AR/VR experiences, and marketplace utilities.\nNFT Ecosystem:\n\nTwo distinct NFT collections:\nInvestors NFTs: Provide access to financial dividends, governance rights, and exclusive investment opportunities.\nSupporters NFTs: Enhance the fan experience with unique perks like match access, AR/VR content, and direct player interactions.\nDecentralized Application (DApp):\n\nA state-of-the-art platform offering community engagement, airdrop rewards, DAO functionality, NFT integration, and AR/VR match streaming.\nTransparency and Security:\n\nLeveraging MultiversX’s robust infrastructure, CryptoX F.C. ensures secure, scalable, and seamless interactions within its ecosystem.\nOvidiu Pop – Strategic Ambassador for CryptoX F.C.\nOvidiu Pop, a prominent figure in the digital and sports marketing space with over 2 million followers across platforms like YouTube, Instagram, and Facebook, serves as the Strategic Ambassador for CryptoX F.C. His role includes:\n\nAmplifying the project’s global reach through innovative digital campaigns.\nBuilding a bridge between traditional football audiences and blockchain enthusiasts.\nEnhancing the visibility of CRX and NFT collections among diverse audiences.\nOvidiu’s expertise and influence are integral to positioning CryptoX F.C. as a leading brand in the intersection of sports and blockchain technology.\n\nWhy MultiversX?\nCryptoX F.C. chose MultiversX for its cutting-edge blockchain capabilities, including scalability, low transaction costs, and a developer-friendly ecosystem. This alignment ensures that the CRX token and supporting technologies remain sustainable and user-centric, offering unparalleled experiences for fans and investors.\n\nGoals and Roadmap:\n\n2025: Launch the CRX token and decentralized application (DApp).\n2026-2028: Expand functionalities such as AR/VR match streaming, fan gamification, and DAO-based governance.\n2030 and Beyond: Build a globally recognized football club driven by blockchain-powered community engagement.\nCommitment to Excellence:\nCryptoX F.C. is dedicated to upholding the highest standards in blockchain integration and football management, aligning with MultiversX branding guidelines to foster innovation and trust within its ecosystem.",
    "status": "active"
}