{
    "website": "https://memeversx.com",
    "description": "EGLDSqueeze: The Ultimate Memecoin\nIntroducing EGLDSqueeze – a memecoin born out of the sheer power of community spirit and viral momentum. This coin has no utility, no grand promises, just pure meme magic. With a capped supply of 100,001 coins, EGLDSqueeze is as rare as it is humorous.\n\nWhat is EGLDSqueeze?\nEGLDSqueeze is a memecoin with one purpose: to bring people together through a shared joke and the thrill of being part of a viral movement. Created in the spirit of fun and camaraderie, it leverages the power of community to drive its value.\n\nThe Movement\nThe EGLDSqueeze movement is about apes uniting and standing strong together. Inspired by the #EGLDSqueeze hashtag and driven by community leader Daniel Veroc 🦍, the movement encourages members to buy EGLD and spread the word. The slogan \"Apes together, STRONG!\" captures the essence of this effort.\n\nHighlights\nTotal Supply: 100,001 EGLDSqueeze coins.\nNo Utility: This coin is purely a meme, with no underlying technology or purpose beyond being part of a joke.\nCommunity-Driven: The value and success of EGLDSqueeze rely entirely on the strength and enthusiasm of its community.\nJoin the Fun\nBe an Ape: Join the movement by purchasing EGLD and becoming part of the #EGLDSqueeze community.\nSpread the Word: Share the meme and invite more apes to join. The more, the merrier!\nYOLO Marketing: Embrace the spirit of YOLO (You Only Live Once) and dive headfirst into the world of memecoins.\nCommunity Insights\nDaniel Veroc 🦍: The voice and face of the EGLDSqueeze movement, rallying apes and pushing the meme forward.\nGrowing Numbers: From 345 members to over 415 and counting, the community is expanding rapidly.\nViral Potential: With tweets and posts encouraging exponential growth, the dream of 1 million apes is alive and well.\nEGLDSqueeze is the ultimate example of a meme bringing people together. It’s about having fun, being part of something bigger, and seeing just how far a joke can go when apes unite. Join the #EGLDSqueeze movement today and be part of the meme revolution!",
    "status": "active",
    "social": {
        "telegram": "https://x.com/i/communities/1806335013320823071"
    }
}
